app/views/books/show.html.erb

                  <%= link_to book_favorites_path(@book_detail), method: :delete do %>
                  ❤︎ <%= @book_detail.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                  <%= link_to book_favorites_path(@book_detail), method: :post do %>
                  ♡ <%= @book_detail.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 8]]