app/controllers/books_controller.rb

  def show
    @book = Book.new
    @book_detail = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
  	@book = Book.new(book_params)
  	# No route matches {:action=>"show", :controller=>"books", :id=>nil}, missing required keys: [:id]というエラーが発生するので下の一行が必要
  	# id:nillというのはuser_idが空ということ
  	# formで送信され内容にはtitleとbodyしか入っていない
    @book.user_id = current_user.id  # ログイン中のユーザーのidを@book.user_idカラムに代入
    if @book.save
      redirect_to book_path(@book.id), notice: "You have creatad book successfully."
    else
      # renderするとindexのviewが表示されるから改めて一覧とユーザー情報の入ったインスタンスをviewに送る必要がある。
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "test1"], ["body", "testtest"], ["created_at", "2020-10-18 04:04:14.616003"], ["updated_at", "2020-10-18 04:04:14.616003"], ["user_id", 1]]
SELECT "books".* FROM "books"