app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("book_id", "user_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_id", 2], ["user_id", 2], ["comment", "knk"], ["created_at", "2020-10-25 09:17:34.500656"], ["updated_at", "2020-10-25 09:17:34.500656"]]
---
	def create
		book = Book.find(params[:book_id])
		# comment = BookComment.new(book_comment_params)
    # comment.user_id = current_user.id 下はこれと同じ意味
		comment = current_user.book_comments.new(book_comment_params)
		comment.book_id = book.id
		comment.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."user_id" = ? AND "book_comments"."id" IS NULL AND "book_comments"."book_id" = ? AND "book_comments"."user_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 1], ["user_id", 2], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]
---
	def destroy
    book = Book.find(params[:book_id])
    book_comment = current_user.book_comments.find_by(id: params[:id], book_id: book.id)
    book_comment.destroy